ROHMUSDC/ROHM_SensorPlatform_Multi-Sensor-Shield/Platform Code/ShieldTesterCode_nRF51-DK/main_20160803_TESTER.cpp
            len = snprintf((char*) buf, MAX_REPLY_LEN, "            ");
            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
            wait_ms(20);
            */
        }
        
        if(printQue){
            if(isPhoneConnected())
            {
                BTLE_DataWrittenHandler();
            }
            printQue = 0;
        }
    }
}

void BTLE_DataWrittenHandler()
{
    int i;
    if (ReceivedValue.length() == 1) {
        switch (ReceivedValue[0]) { 
            
            case 'a':  // TEST1: 
                
                //Initial Test Case: 'a'
                TestPassFlag = 0;
                if(isPhoneConnected())
                {
                    len = sprintf(FormattedData, "Start TEST1");
                    m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                    //Color Sensor Test
                    if(BH1745_Red > 100){
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "COLOR-R PASS");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "COLOR-R FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%u", BH1745_Red);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "RED=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    if(BH1745_Green > 100){
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "COLOR-G PASS");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "COLOR-G FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%u", BH1745_Green);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "GRN=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    if(BH1745_Blue > 100){
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "COLOR-B PASS");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "COLOR-B FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%u", BH1745_Blue);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "BLU=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    wait_ms(100);
                    
                    //Temperature Sensor Testing
                    if(BDE0600_output > 20)
                    {
                        if(BDE0600_output < 30)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "TEMPSEN PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else{
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "TEMPSEN FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", BDE0600_output);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "TMP=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "TEMPSEN FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", BDE0600_output);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "TMP=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    wait_ms(100);
                    
                    //UV Sensor Testing
                    if(ML8511_output > 0)
                    {
                        if(ML8511_output < 2)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "UV SENS PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "UV SENS FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", ML8511_output);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "UV =%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "UV SENS FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", ML8511_output);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "UV =%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    wait_ms(100);
                    
                    //Hall Sensor Testing
                    if(Hall_Return0 == 1){
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "HALL 0  PASS");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "HALL 0  FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%u", Hall_Return0);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "HL0=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    if(Hall_Return1 == 1){
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "HALL 1  PASS");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "HALL 1  FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%u", Hall_Return1);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "HL1=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    wait_ms(100);
                    
                    //ALS/PROX Testing
                    if(RPR0521_ALS_OUT > 100){
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "0521ALS PASS");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "0521ALS FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", RPR0521_ALS_OUT);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "ALS=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    if(RPR0521_PS_RAWOUT < 30){
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "0521PRX PASS");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "0521PRX FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%u", RPR0521_PS_RAWOUT);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "PRX=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    wait_ms(100);
                    
