ROHMUSDC/ROHM_SensorPlatform_Multi-Sensor-Shield/Platform Code/ShieldTesterCode_nRF51-DK/main_20160803_TESTER.cpp
                    //KMX62 ACCEL/MAG Testing
                    if(MEMS_Accel_Conv_Xout > -0.2f)
                    {
                        if(MEMS_Accel_Conv_Xout < 0.2f)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62ACCX PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else{
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62ACCX FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", MEMS_Accel_Conv_Xout);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "ACX=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "K62ACCX FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", MEMS_Accel_Conv_Xout);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "ACX=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    
                    if(MEMS_Accel_Conv_Yout > -0.2f)
                    {
                        if(MEMS_Accel_Conv_Yout < 0.2f)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62ACCY PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else{
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62ACCY FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", MEMS_Accel_Conv_Yout);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "ACY=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "K62ACCY FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", MEMS_Accel_Conv_Yout);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "ACY=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    
                    if(MEMS_Accel_Conv_Zout > 0.8f)
                    {
                        if(MEMS_Accel_Conv_Zout < 1.2f)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62ACCZ PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else{
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62ACCZ FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", MEMS_Accel_Conv_Zout);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "ACZ=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "K62ACCZ FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", MEMS_Accel_Conv_Zout);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "ACZ=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    
                    if(MEMS_Mag_Conv_Xout > -0.2f)
                    {
                        if(MEMS_Mag_Conv_Xout < 0.2f)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62MAGX PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else{
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62MAGX FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", MEMS_Mag_Conv_Xout);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MGX=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "K62MAGX FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", MEMS_Mag_Conv_Xout);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "MGX=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    
                    if(MEMS_Mag_Conv_Yout > -0.2f)
                    {
                        if(MEMS_Mag_Conv_Yout < 0.2f)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62MAGY PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else{
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62MAGY FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", MEMS_Mag_Conv_Yout);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MGY=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "K62MAGX FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", MEMS_Mag_Conv_Yout);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "MGY=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }

                    if(MEMS_Mag_Conv_Zout > -0.2f)
                    {
                        if(MEMS_Mag_Conv_Zout < 0.2f)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62MAGZ PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else{
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "K62MAGZ FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", MEMS_Mag_Conv_Zout);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MGZ=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "K62MAGZ FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", MEMS_Mag_Conv_Zout);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "MGZ=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    wait_ms(100);
                
                    //KX122 ACCEL Testing
                    if(KX122_Accel_X > -0.2f)
                    {
                        if(KX122_Accel_X < 0.2f)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "122ACCX PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else{
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "122ACCX FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", KX122_Accel_X);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "ACX=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "122ACCX FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", KX122_Accel_X);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "ACX=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    
                    if(KX122_Accel_Y > -0.2f)
                    {
                        if(KX122_Accel_Y < 0.2f)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "122ACCY PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else{
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "122ACCY FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", KX122_Accel_Y);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "ACY=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "122ACCY FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", KX122_Accel_Y);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "ACY=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }                   
                
                    if(KX122_Accel_Z > 0.8f)
                    {
                        if(KX122_Accel_Z < 1.2f)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "122ACCZ PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else{
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "122ACCZ FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", KX122_Accel_Z);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "ACZ=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "122ACCZ FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", KX122_Accel_Z);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "ACZ=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    wait_ms(100);
                
