ROHMUSDC/ROHM_SensorPlatform_Multi-Sensor-Shield/Platform Code/ShieldTesterCode_nRF51-DK/main_20160803_TESTER.cpp
                    //Pressure Sensor Test
                    if(BM1383_Temp_Conv_Out > 20)
                    {
                        if(BM1383_Temp_Conv_Out < 30)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "TEMPSEN PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "TEMPSEN FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", BM1383_Temp_Conv_Out);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "TMP=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else
                    {
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "TEMPSEN FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", BM1383_Temp_Conv_Out);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "TMP=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    
                    if(BM1383_Pres_Conv_Out > 900)
                    {
                        if(BM1383_Pres_Conv_Out < 1100)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "PRESSEN PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "PRESSEN FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", BM1383_Pres_Conv_Out);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "PRS=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else
                    {
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "PRESSEN FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", BM1383_Pres_Conv_Out);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "PRS=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    wait_ms(100);
                    
                    //Need to Write Mag CHECK
                    if(BM1422_MAG_X_RawOUT > -2500)
                    {
                        if(BM1422_MAG_X_RawOUT < 2500)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MAGN X  PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MAGN X  FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%i", BM1422_MAG_X_RawOUT);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MGX=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else
                    {
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "MAGN X  FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%i", BM1422_MAG_X_RawOUT);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "MGX=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    
                    if(BM1422_MAG_Y_RawOUT > -2500)
                    {
                        if(BM1422_MAG_Y_RawOUT < 2500)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MAGN Y  PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MAGN Y  FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%i", BM1422_MAG_Y_RawOUT);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MGY=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else
                    {
						1060904
						
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "MAGN Y  FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%i", BM1422_MAG_Y_RawOUT);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "MGY=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    if(BM1422_MAG_Z_RawOUT > -2500)
                    {
                        if(BM1422_MAG_Z_RawOUT < 2500)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MAGN Z  PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MAGN Z  FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%i", BM1422_MAG_Z_RawOUT);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "MGZ=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else
                    {
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "MAGN Z  FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%i", BM1422_MAG_Z_RawOUT);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "MGZ=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    
                    
                    
                    //Gyro Testing
                    if(KXG03_Gyro_X > -2)
                    {
                        if(KXG03_Gyro_X < 2)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "Gyro X  PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "Gyro X  FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", KXG03_Gyro_X);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "GYX=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else
                    {
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "Gyro X  FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", KXG03_Gyro_X);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "GYX=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }

                    if(KXG03_Gyro_Y > -2)
                    {
                        if(KXG03_Gyro_Y < 2)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "Gyro Y  PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "Gyro Y  FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", KXG03_Gyro_Y);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "GYY=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else
                    {
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "Gyro Y  FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", KXG03_Gyro_Y);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "GYY=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    
