ROHMUSDC/ROHM_SensorPlatform_Multi-Sensor-Shield/Platform Code/ShieldTesterCode_nRF51-DK/main_20160803_TESTER.cpp
                    if(KXG03_Gyro_Z > -2)
                    {
                        if(KXG03_Gyro_Z < 2)
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "Gyro Z  PASS");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        }
                        else
                        {
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "Gyro Z  FAIL");
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            wait_ms(20);
                            sprintf(FormattedData, "%f", KXG03_Gyro_Z);
                            len = snprintf((char*) buf, MAX_REPLY_LEN, "GYZ=%s", FormattedData);
                            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                            TestPassFlag = 1;
                        }
                    }
                    else
                    {
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "Gyro Z  FAIL");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        wait_ms(20);
                        sprintf(FormattedData, "%f", KXG03_Gyro_Z);
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "GYZ=%s", FormattedData);
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                        TestPassFlag = 1;
                    }
                    
                    if(TestPassFlag == 1){
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "TEST FAILED");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                    }
                    else{
                        len = snprintf((char*) buf, MAX_REPLY_LEN, "TEST PASSED");
                        m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                    }
                    
                }
                break;
              
            case 'p':  // alarm enable
                //isPanic = !isPanic;
                //len = snprintf((char*) buf, MAX_REPLY_LEN, "isPanic= %u",isPanic);  
                //len = sprintf(FormattedData, "%03u", FWVersion);
                
                //NOTE:
                /*
                sprintf(FormattedData, "%03u", FWVersion);
                len = snprintf((char*) buf, MAX_REPLY_LEN, "RMK%s", FormattedData);
                m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
                */
                break;

            case 'r': //System Reset
                NVIC_SystemReset(); //Q. What is this? no break statement?
                                    //A. SoftReset... No need for break because this resets the program...
                break;
                
            default:
                //len = snprintf((char*) buf, MAX_REPLY_LEN, "1b,ERROR");
                break;
        }
    }
    else if (ReceivedValue.length() > 1) {
        
        //BTLE Interface Code, Added 5/29/2016
        /*
        ReceivedValue.clear();
        for(i = 0; i < params->len; i++)
        {
            ReceivedValue += params->data[i];
        }
        */
        for(i = 0; i < 29; i++)
        {
            FormattedData[i] = '\0';
        }
        
        if(ReceivedValue.compare(0,4,"VER?") == 0)
        {
            //sprintf(FormattedData, "%03u", FWVersion);
            //len = snprintf((char*) buf, MAX_REPLY_LEN, "VER%s", FormattedData);
        }
        
        else if(ReceivedValue.compare(0,3,"FAR") == 0)
        {
            //len = snprintf((char*) buf, MAX_REPLY_LEN, "FAR0");
        }
        
        else
        {
            //len = snprintf((char*) buf, MAX_REPLY_LEN, "??? = %s", ReceivedValue.c_str());
        }

    }
    else
    {
        len = snprintf((char*) buf, MAX_REPLY_LEN, "ERROR-L");
    }
    m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
    //DEBUG("%d bytes received from host\n\r", ReceivedValue.length());
    //ReceivedValue.clear();
}